In [7]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\bharaman\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\bharaman\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\bharaman\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\bharaman\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.21.0 in c:\users\bharaman\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\bharaman\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [2]:
# Pandas ====> Open-Source Library that is used for data handling data manipulations .

In [3]:
# Data Structure of Pandas ===>>>>>

# (1). Series ===> One-dimensional array , it shows only values not column name .  

# (2). DataFrame ===> Multi-dimensional array , it shows values with column name .

# (1). Series

In [4]:
import pandas as pd

In [5]:
a = pd.Series([1,45,78,90])
a

0     1
1    45
2    78
3    90
dtype: int64

In [6]:
type(a)

pandas.core.series.Series

# (2). DataFrame

In [21]:
a ={
    "Emp_Id":[101,102,103,104,105,106,107,108],
    "Name" :['A','B','A','A','C','A','B','D'],
    "Department":['IT','HR','Sales','IT','HR','IT','HR', 'ÍT'],
    "Working_hours":[8,6,5,3,6,9,8,6],
    "Salary":[23000,25000,26000,27000,3000,32000,45000,37000]
}

In [22]:
type(a)

dict

In [23]:
df=pd.DataFrame(a)
df

   Emp_Id Name Department  Working_hours  Salary
0     101    A         IT              8   23000
1     102    B         HR              6   25000
2     103    A      Sales              5   26000
3     104    A         IT              3   27000
4     105    C         HR              6    3000
5     106    A         IT              9   32000
6     107    B         HR              8   45000
7     108    D         ÍT              6   37000

# How can we check top 5 data in a dataframe ?

In [24]:
df.head()

   Emp_Id Name Department  Working_hours  Salary
0     101    A         IT              8   23000
1     102    B         HR              6   25000
2     103    A      Sales              5   26000
3     104    A         IT              3   27000
4     105    C         HR              6    3000

In [25]:
df.head(3)

   Emp_Id Name Department  Working_hours  Salary
0     101    A         IT              8   23000
1     102    B         HR              6   25000
2     103    A      Sales              5   26000

# How can we check bottom 5 data ?

In [31]:
df.tail()

   Emp_Id Name Department  Working_hours  Salary
3     104    A         IT              3   27000
4     105    C         HR              6    3000
5     106    A         IT              9   32000
6     107    B         HR              8   45000
7     108    D         ÍT              6   37000

In [32]:
df.tail(4)

   Emp_Id Name Department  Working_hours  Salary
4     105    C         HR              6    3000
5     106    A         IT              9   32000
6     107    B         HR              8   45000
7     108    D         ÍT              6   37000

# How can we check random indexed data ?

In [33]:
df.sample(3)

   Emp_Id Name Department  Working_hours  Salary
4     105    C         HR              6    3000
0     101    A         IT              8   23000
1     102    B         HR              6   25000

# How can we check total columns in a dataframe ?

In [34]:
df.columns

Index(['Emp_Id', 'Name', 'Department', 'Working_hours', 'Salary'], dtype='object')

# How can we check total columns in a dataframe ?

In [35]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Emp_Id         8 non-null      int64
 1   Name           8 non-null      object
 2   Department     8 non-null      object
 3   Working_hours  8 non-null      int64
 4   Salary         8 non-null      int64
dtypes: int64(3), object(2)
memory usage: 452.0+ bytes

# How can we check statically view of our data ?

In [36]:
df.describe()

          Emp_Id  Working_hours        Salary
count    8.00000        8.00000      8.000000
mean   104.50000        6.37500  27250.000000
std      2.44949        1.92261  12221.176001
min    101.00000        3.00000   3000.000000
25%    102.75000        5.75000  24500.000000
50%    104.50000        6.00000  26500.000000
75%    106.25000        8.00000  33250.000000
max    108.00000        9.00000  45000.000000

# How can we export our dataframe into local system ?

In [40]:
df.to_csv("C:\\Users\\BHARAMAN\\Desktop\\manish\\emp.csv",index=False)

In [ ]:
df.to_excel("C:\\Users\\BHARAMAN\\Desktop\\manish\\New_emp.csv" , index = False)

In [44]:
#!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\bharaman\anaconda3\lib\site-packages (3.0.10)
Requirement already satisfied: et_xmlfile in c:\users\bharaman\anaconda3\lib\site-packages (from openpyxl) (1.1.0)

# How can we import our file into juupyternotebook ?

In [43]:
df =pd. read_csv("C:\\Users\\BHARAMAN\\Desktop\\manish\\emp.csv")
df

   Emp_Id Name Department  Working_hours  Salary
0     101    A         IT              8   23000
1     102    B         HR              6   25000
2     103    A      Sales              5   26000
3     104    A         IT              3   27000
4     105    C         HR              6    3000
5     106    A         IT              9   32000
6     107    B         HR              8   45000
7     108    D         ÍT              6   37000